

insert into artist(artist_id, artist_name)
values 
	(1, 'КОНВИРСЫ'), 
	(2, '104'), 
	(3, 'Скриптонит'), 
	(4, 'нексюша'), 
	(5, 'Pouya'), 
	(6, 'Babymetal'),
	(7, 'Sasha Gray'),
	(8, 'RAM');

insert into genre(genre_title) 
values 
	('rapcore'),
	('rock'),
	('rap'),
	('pop'),
	('metal');

insert into genre_artist 
values
	(1,4),
	(2,3),
	(3,3),
	(3,4),
	(4,4),
	(5,3),
	(6,2),
	(6,5),
	(7,2),
	(8,1),
	(8,3);

insert into album 
values
	(1, 'Кино без сигарет', '2020-01-01'),
	(2, 'Уроборос: Зеркала', '2017-01-01'),
	(3, 'И СМЕХ И ГРЕХ', '2022-01-01'),
	(4, 'FIVE FIVE', '2018-01-01'),
	(5, 'Metal Resistance', '2016-01-01'),
	(6, 'Starscream', '2022-01-01'),
	(7, 'Герои лета', '2015-01-01'),
	(8, 'Какао', '2021-01-01');
	
insert into album_artist 
values 
	(1,1),
	(2,2),
	(3,3),
	(4,4),
	(5,5),
	(6,6),
	(7,7),
	(8,8);

insert into track 
values 
	(1, '00:02:19', 1, 'Братик III'),
	(2,	'00:05:06',	1, 'Зеркала'),
	(3, '00:02:02', 3, '500 рублей'),
	(4,	'00:02:59',	4, 'Aftershock'),
	(5,	'00:04:23',	5, 'Karate'),
	(6,	'00:03:16', 6, 'My Detonator'),
	(7,	'00:04:15', 7, 'Герои лета'),
	(8,	'00:02:37', 8, 'Мой Какао'),
	(9, '00:02:45', 2, 'ДО ОБЕДА'),
	(10, '00:02:57', 2, 'Слюни'),
	(11, '00:02:47', 3, 'Весна'),
	(12, '00:02:15', 4, 'FIVE FIVE'),
	(13, '00:02:47', 5, 'Sis.Anger'),
	(14, '00:03:36', 6, 'Неоновый рок'),
	(15, '00:03:34', 7, 'Колыбель разврата'),
	(16, '00:03:33', 8, 'Какая-то песня');

insert into collection 
values 
	(1, 'Collection_1', '2014-01-01'),
	(2, 'Collection_2', '2015-01-01'),
	(3, 'Collection_3', '2016-01-01'),
	(4, 'Collection_4', '2017-01-01'),
	(5, 'Collection_5', '2018-01-01'),
	(6, 'Collection_6', '2019-01-01'),
	(7, 'Collection_7', '2020-01-01'),
	(8, 'Collection_8', '2021-01-01');

insert into collection_track 
values
	(1,1),
	(2,1),
	(3,3),
	(4,4),
	(5,5),
	(6,6),
	(7,7),
	(8,8),
	(9,2),
	(10,2),
	(11,3),
	(12,4),
	(13,5),
	(14,6),
	(15,7);